package lesson01;

public class Exam03 {
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		// 변수선언과 함께 값 대입
		int a = 3 ;
		
		// 변수선언 후 값 대입
		int b ;
		b = 4;
		
		System.out.println(a);
		System.out.println(b);
		
/*		
 * 변수명
1. 영문 대소문자와 한글도 사용할 수 있다.(한글사용은 권장하지 않는다.)
2. 특수 문자는 밑줄_과 달러$만 사용할 수 있다.(ex>#abc(x))
3. 숫자는 사용할 수 있으나 첫글자로는 사용할 수 없다.(ex>3a(x))
4. 예약어는 사용할 수 없다.(ex>int(x),public(x))
5. 영문 소문자 사용을 권장한다.
6. 의미가 있는 단어의 사용을 권장한다.
7. 여러 단어를 사용할 때에는 두번째 단어부터는 첫글자를 대문자로 하는 것을 권장한다.
	(ex>myWork, maxValue
*/
		
/*
 * 변수의 범위
 * 변수의 생존 기간은 메모리에 변수가 만들어진 이후 사라지기까지의 기간으로 볼수 있다.
 * 자바는 개발자가 직접 변수를 생성한다. 하지만, 변수를 삭제하는 작업은 자바가
 * 알아서한다. 변수를 삭제하는 주체가 개발자가 아니기 때문에 메모리에서 변수가 
 * 사라지는 시점을 이해는 것이 중요하다. 만약 사라진 변수 값을 읽거나 값을 대입하려고
 * 하면 문법 오류가 발생한다.
 */
	}
}